org 0x100               ;Вказуємо, що це програма .COM формат

section .data
    a db 5              ;Задаємо значення змінної a = 5
    b db 3              ;Задаємо значення змінної b = 3
    c db 2              ;Задаємо значення змінної c = 2
    resultMsg db 'Result: $' ;Повідомлення про результат

section .text
_start:
    mov al, [b]         ;Завантажуємо b в al
    sub al, [c]         ;Віднімаємо c від b
    add al, [a]         ;Додаємо a до результату

    ; Перетворення отриманого результату у символ ASCII (для однозначних чисел)
    add al, 30h         ;Перетворюємо результат у ASCII символ

    ; Виведення повідомлення та результату
    mov ah, 09h         ;Функція DOS для виведення рядка
    lea dx, resultMsg   ;Адреса message у DX для виведення
    int 21h             ;Виклик DOS-переривання

    ; Виведення результату
    mov dl, al          ;Поміщаємо результат у DL для виводу
    mov ah, 02h         ;Функція DOS для виведення символу
    int 21h             ;Виклик DOS-переривання

    ; Завершення програми
    mov ax, 4c00h       ;Функція DOS для завершення програми
    int 21h             ;Виклик DOS-переривання